reference/reference_node_push.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet Reference - Push over SSH</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-17 00:01:41 EDT"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet reference documentation for pushing over SSH"/>
<meta name="keywords" content="pallet ssh push keys identity"/>
<link rel="stylesheet" type="text/css" href="doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>
<link rel="stylesheet" type="text/css" href="../doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Pallet Reference - Push over SSH</h1>

<p>Pallet executes scripts using push over SSH. Pallet provides several methods for
handling SSH identities.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">The <code>admin</code> User </h2>
<div class="outline-text-2" id="text-1">


<p>
To SSH to a node, pallet requires a username and an SSH key.  You can pass
the admin-user object (use <code>pallet.utils/make-user</code> to create one) to <code>lift</code>
and <code>converge</code> using the :user keyword.
</p>
<p>
For REPL use there is a rebindable var, <code>pallet.utils/*admin-user*</code>, that
provides the default admin user. This defaults to your username, and
<code>id_rsa</code> identity.  You can rebind this using <code>pallet.core/with-admin-user</code>.
</p>

</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1">Environment </h3>
<div class="outline-text-3" id="text-1_1">

<p>The admin user can also be specified in the :environment
</p>



<pre class="src src-clojure">(defpallet
  <span style="color: #0000ff;">:serivces</span>
    {<span style="color: #0000ff;">:aws</span>
      {<span style="color: #0000ff;">:provider</span> <span style="color: #f4a460;">"ec2"</span> <span style="color: #0000ff;">:identity</span> <span style="color: #f4a460;">"key"</span> <span style="color: #0000ff;">:credential</span> <span style="color: #f4a460;">"secret-key"</span>
       <span style="color: #0000ff;">:environment</span>
         {<span style="color: #0000ff;">:user</span> {<span style="color: #0000ff;">:username</span> <span style="color: #f4a460;">"admin"</span>
                 <span style="color: #0000ff;">:private-key-path</span> <span style="color: #f4a460;">"/path/to/private-key"</span>
                 <span style="color: #0000ff;">:public-key-path</span> <span style="color: #f4a460;">"/path/to/public-key"</span>}}}})
</pre>




</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2">Lein and Cake </h3>
<div class="outline-text-3" id="text-1_2">

<p>You can configure the admin-user that is used by the lein and cake plugins,
in the <a href="file:///Users/duncan/.pallet/config.clj">~/.pallet/config.clj</a> file.
</p>



<pre class="src src-clojure">(defpallet
  <span style="color: #0000ff;">:admin-user</span>
    {<span style="color: #0000ff;">:username</span> <span style="color: #f4a460;">"admin"</span>
     <span style="color: #0000ff;">:private-key-path</span> <span style="color: #f4a460;">"/path/to/private-key"</span>
     <span style="color: #0000ff;">:public-key-path</span> <span style="color: #f4a460;">"/path/to/public-key"</span>})
</pre>



</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Other SSH Key Strategies </h2>
<div class="outline-text-2" id="text-2">

<p>While convenient, having all your nodes authorise the same SSH key is not the
best security practice.  Pallet allows you to install a function to provide an
identity using you own strategy, with <code>pallet.core/with-middleware</code>. A
per node identity could be implemented using something like this:
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.utils)
(<span style="color: #0000ff;">require</span> 'pallet.execute)
(<span style="color: #0000ff;">require</span> 'clj-ssh.ssh)

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">lookup-identity</span> [node]
  <span style="color: #8b0000;">;; </span><span style="color: #cd5c5c;">Implement this to
</span>  <span style="color: #8b0000;">;; </span><span style="color: #cd5c5c;">return [private-key public-key passphrase]
</span>  )

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">node-based-identity</span>
  [handler]
  (<span style="color: #0000ff;">fn</span> [request]
    (<span style="color: #4682b4;">binding</span> [pallet.execute/default-agent-atom (<span style="color: #0000ff;">atom</span> nil)]
      (<span style="color: #0000ff;">apply</span> clj-ssh.ssh/add-identity
       (pallet.execute/default-agent)
       (lookup-identity))
      (handler request))))
</pre>






</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-06-17 00:01:41 EDT</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
